#+title: Ps 02
#+author: Erik An
#+email: obluda2173@gmail.com
#+date: <2026-03-14>
#+lastmod: <2026-04-13 17:28>
#+latex: \newpage
#+latex_header: \setlength{\parindent}{0pt}
#+latex_header: \setlength{\parskip}{1em}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{amssymb}
#+latex_header: \usepackage{mathtools}
#+latex_header: \usepackage{amsthm}
#+latex_header: \usepackage[margin=1in]{geometry}
#+options: num:t tags:nil
#+property: header-args :eval never-export
#+startup: overview latexpreview inlineimages

*** (c)

#+begin_src julia :results value :exports both :tangle julia/p_03_03.jl
using Plots

ys_range = -1:0.01:1

A_xs = [x for x in ys_range for y in ys_range if x^2 + y^2 < 1]
A_ys = [y for x in ys_range for y in ys_range if x^2 + y^2 < 1]

B_xs = [fill(-1, length(ys_range)); fill(1, length(ys_range))]
B_ys = [collect(ys_range); collect(ys_range)]

opts = (xlabel="x", ylabel="y", markersize=1, aspect_ratio=:equal, legend=false)

p_1 = scatter(A_xs, A_ys; title="Set A", opts...)
p_2 = scatter(B_xs, B_ys; title="Set B", opts...)

plot(p_1, p_2)
savefig("./assets/p_03_03_01.png")
#+end_src

#+RESULTS:
: /Users/ziro2173/personal/university/01_bachelor/02_semester/01_analysis/02_exercises/set_02/assets/p_03_03_01.png

Hence,

$A$ is path-connected (straight line between any two points stays inside).

$B$ is not path-connected (the two segments are disjoint).

*** (b)

#+begin_src julia :results output :exports both :tangle julia/p_04_02.jl
f(x) = 1/4 * (x^2 + 1)

function fixed_point_iteration(f, x_0, tol=1e-10, max_iter=100)
    x = x_0
    for n in 1:max_iter
        x_new = f(x)
        if abs(x_new - x) < tol
            println("Converged after $n iterations")
            return x_new
        end
        x = x_new
    end
    @warn "Did not converge within $max_iter iterations"
    return x
end

x_star = fixed_point_iteration(f, 0.0)
println("Fixed point: $x_star")
println("Exact value: $(2 - sqrt(3))")
#+end_src

#+RESULTS:
: f (generic function with 1 method)
: fixed_point_iteration (generic function with 3 methods)
: Converged after 12 iterations
: 0.26794919242681425
: Fixed point: 0.26794919242681425
: Exact value: 0.2679491924311228
